plugins/ruk/eed/server/essruk2-matej6.wsdl

<?xml version='1.0' encoding='UTF-8'?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. -->
<definitions xmlns:wssutil="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ess.bbm/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ess.bbm/" name="eed_konektor">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://mvcr.cz/ess/v_1.0.0.0" schemaLocation="http://exon-ruk.matej6.tmapserver.cz/ost/posta/plugins/ruk/eed/server/mvcr.cz_ess_v_1.0.0.0.wsdl"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://isds.czechpoint.cz/v20" schemaLocation="http://exon-ruk.matej6.tmapserver.cz/ost/posta/plugins/ruk/eed/server/isds.czechpoint.cz_v20.wsdl"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://ess.bbm/" schemaLocation="http://exon-ruk.matej6.tmapserver.cz/ost/posta/plugins/ruk/eed/server/ess.bbm.wsdl"/>
    </xsd:schema>
  </types>
  <message name="vlozDokument">
    <part name="parameters" element="tns:vlozDokument"/>
  </message>
  <message name="vlozDokumentResponse">
    <part name="parameters" element="tns:vlozDokumentResponse"/>
  </message>
  <message name="vlozPrilohu">
    <part name="parameters" element="tns:vlozPrilohu"/>
  </message>
  <message name="vlozPrilohuResponse">
    <part name="parameters" element="tns:vlozPrilohuResponse"/>
  </message>
  <portType name="eed_konektor">
    <operation name="vlozDokument">
      <input message="tns:vlozDokument"/>
      <output message="tns:vlozDokumentResponse"/>
    </operation>
    <operation name="vlozPrilohu">
      <input message="tns:vlozPrilohu"/>
      <output message="tns:vlozPrilohuResponse"/>
    </operation>
  </portType>
  <binding name="eed_konektorPortBinding" type="tns:eed_konektor">
    <wsp:PolicyReference URI="#Wssp1.2-2007-Https-UsernameToken-Plain.xml"/>
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="vlozDokument">
      <soap:operation soapAction="http://exon-ruk.matej6.tmapserver.cz/ost/posta/plugins/ruk/eed/server/soap.php/vlozDokument"/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
    <operation name="vlozPrilohu">
      <soap:operation soapAction="http://exon-ruk.matej6.tmapserver.cz/ost/posta/plugins/ruk/eed/server/soap.php/vlozPrilohu"/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="eed_konektor">
    <port name="eed_konektorPort" binding="tns:eed_konektorPortBinding">
      <soap:address location="http://exon-ruk.matej6.tmapserver.cz/ost/posta/plugins/ruk/eed/server/soap.php"/>
    </port>
  </service>
</definitions>